In [7]:
import pandas as pd
import numpy as np

x = np.arange(10).reshape(5,2)
df = pd.DataFrame(x)
df

   0  1
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [8]:
df.columns = ['first', 'last']
df.index = ['top', 'second', 'third', 'fourth', 'bottom']
df

        first  last
top         0     1
second      2     3
third       4     5
fourth      6     7
bottom      8     9

In [9]:
# This list will become our row names.
names = ['George',
         'John',
         'Thomas',
         'James',
         'Andrew',
         'Martin',
         'William',
         'Zachary',
         'Millard',
         'Franklin']

# Create an empty data frame with named rows.
purchases = pd.DataFrame(index=names)

# Add our columns to the data frame one at a time.
purchases['country'] = ['US', 'CAN', 'CAN', 'US', 'CAN', 'US', 'US', 'US', 'CAN', 'US']
purchases['ad_views'] = [16, 42, 32, 13, 63, 19, 65, 23, 16, 77]
purchases['items_purchased'] = [2, 1, 0, 8, 0, 5, 7, 3, 0, 5]
purchases

         country  ad_views  items_purchased
George        US        16                2
John         CAN        42                1
Thomas       CAN        32                0
James         US        13                8
Andrew       CAN        63                0
Martin        US        19                5
William       US        65                7
Zachary       US        23                3
Millard      CAN        16                0
Franklin      US        77                5

In [11]:
purchases['items_purchased'] / purchases['ad_views']

George      0.125000
John        0.023810
Thomas      0.000000
James       0.615385
Andrew      0.000000
Martin      0.263158
William     0.107692
Zachary     0.130435
Millard     0.000000
Franklin    0.064935
dtype: float64

In [16]:
purchases.iloc[0:3, 2]

George    2
John      1
Thomas    0
Name: items_purchased, dtype: int64

In [19]:
purchases.loc[lambda df: purchases['items_purchased'] > 2, :]

         country  ad_views  items_purchased
James         US        13                8
Martin        US        19                5
William       US        65                7
Zachary       US        23                3
Franklin      US        77                5

In [20]:
purchases.groupby('country')

In [22]:
purchases.groupby('country').mean()

         ad_views  items_purchased
country
CAN         38.25             0.25
US          35.50             5.00